---
kind: method
id: M:Autodesk.Revit.UI.DoubleClickOptions.GetRenameOnSlowDoubleClickInProjectBrowser
source: html/b866e8dc-9ad0-7aeb-40fb-dcb1f28c4d73.htm
---
# Autodesk.Revit.UI.DoubleClickOptions.GetRenameOnSlowDoubleClickInProjectBrowser Method

Returns the user's desire to rename item in project browser on slow double-click.

## Syntax (C#)
```csharp
public bool GetRenameOnSlowDoubleClickInProjectBrowser()
```